
const questions_data = {
    current_question_id: 0
}

const questions = [
    {
        id: 0,
        text: 'מה היא עיר הבירה של אתיופיה ?',
        answers: ['מוגדישו', 'אדיס אבבה', 'ניירובי', 'קמפאלה'],
        correct_answer: 2
    },
    {
        id: 1,
        text: 'מה היא עיר הבירה של בלגיה ?',
        answers: ['בריסל', 'ברן', 'פראג', 'פוזנן'],
        correct_answer: 1
    },
    {
        id: 2,
        text: 'מה היא עיר הבירה של קרואטיה ?',
        answers: ['ספליט', 'זאגרב', 'סרייבו', 'בלגרד'],
        correct_answer: 1
    },
    {
        id: 3,
        text: 'מה היא עיר הבירה של אוסטרליה ?',
        answers: ['סידני', 'מלבורן', 'קנברה', 'פרתי'],
        correct_answer: 2
    },
    {
        id: 4,
        text: 'מה היא עיר הבירה של ירדן ?',
        answers: ['מדינה', 'עמאן', 'דמשק', 'ביירות'],
        correct_answer: 2
    },
    {
        id: 5,
        text: 'במה מפורסמת איסטנבול ?',
        answers: ['השתלת שיעור ורפואת שיניים', 'משחקי כדורגל', 'בקלאווה עם חלווה', '( א ו ג ) הם הנכון'],
        correct_answer: 4
    },
    {
        id: 6,
        text: 'באיזו שפה מדברת ברזיל ?',
        answers: ['השפה הפורטוגזית', 'השפה הארגנטינאי', 'השפה האנגלית', 'השפה הפולני'],
        correct_answer: 1
    },
    {
        id: 7,
        text: 'מה הייתה המדינה הראשונה שבה התפשט נגיף הקורונה ?',
        answers: ['איטליה', 'הודו', 'ווהאן , סין', 'איסטנבול'],
        correct_answer: 3
    },
    {
        id: 8,
        text: 'מה היא המדינה האירופית הגדולה ביותר מבחינת שטח ?',
        answers: ['ספרד', 'רוסיה', 'אוקראינה , סין', 'צרפת'],
        correct_answer: 2
    },
    {
        id: 9,
        text: 'מה הוא השטח של אוקראינה ?',
        answers: ['551,695', '498,468', '3,972,400', '603,628'],
        correct_answer: 4
    },
    {
        id: 10,
        text: 'כמה מספר התושבים של גרמניה ?',
        answers: ['66 מיליון', '47 מיליון', '83 מיליון', '77 מילון'],
        correct_answer: 3
    },
    {
        id: 11,
        text: 'כמה מספר התושבים של טורקיה ?',
        answers: ['84 מיליון', '165 מיליון', '92 מיליון', '100 מיליון'],
        correct_answer: 1
    },
    {
        id: 12,
        text: 'כמה מספר התושבים של רוסיה ?',
        answers: ['130 מיליון', '210 מיליון', '90 מיליון', '144 מיליון'],
        correct_answer: 4
    },
    {
        id: 13,
        text: 'כמה מספר התושבים של צרפת ?',
        answers: ['50 מיליון', '67 מיליון', '94 מיליון', '55 מיליון'],
        correct_answer: 2
    },
    {
        id: 14,
        text: 'כמה מספר התושבים של ארצות הברית ?',
        answers: ['202 מיליון', '410 מיליון', '177 מיליון', '329 מיליון'],
        correct_answer: 4
    },
    {
        id: 15,
        text: 'מה היא עיר הבירה של פורטוגל ?',
        answers: ['פורטו', 'קוימברה', 'מדריד', 'ליסבון'],
        correct_answer: 4
    },
    {
        id: 16,
        text: 'באיזה מטבע משתמשים בתאילנד ?',
        answers: ['רופי', 'באט', 'קרונה', 'דינר'],
        correct_answer: 2
    },
    {
        id: 17,
        text: 'מה היא עיר הבירה של פולין ?',
        answers: ['קרקוב', 'ורשה', 'לודג\'', 'סטוקהולם'],
        correct_answer: 2
    },
    {
        id: 18,
        text: 'מה היא עיר הבירה של ניו זילנד ?',
        answers: ['ואנקה', 'קווינסטאון', 'ולינגטון', 'אוקלנד'],
        correct_answer: 3
    },
    {
        id: 19,
        text: 'מה היא עיר הבירה של בולגריה ?',
        answers: ['וארנה', 'בורגס', 'בוקרשט', 'סופיה'],
        correct_answer: 4
    },
]

const questions2 = [
    {
        id: 20,
        text: 'מה היא עיר הבירה של קנדה ?',
        answers: ['ונקובר', 'טורונטו', 'מונטריאול', 'אוטווה'],
        correct_answer: 4
    },
    {
        id: 21,
        text: 'מה היא עיר הבירה של קולומביה?',
        answers: ['מדיין', 'בוגוטה', 'לה פאס', 'לימה'],
        correct_answer: 2
    },
    {
        id: 22,
        text: 'מה היא עיר הבירה של מלטה?',
        answers: ['סלימה', 'ולטה', 'מדינה', 'ויקטוריה'],
        correct_answer: 2
    },
    {
        id: 23,
        text: 'מה היא עיר הבירה של תימן?',
        answers: ['צנעא', 'גתסיטי', 'זביד', 'תעז'],
        correct_answer: 1
    },
    {
        id: 24,
        text: 'מה היא עיר הבירה של פקיסטן?',
        answers: ['איסלמבאד', 'לאהור', 'קראצ\'י', 'פשאוור'],
        correct_answer: 1
    },
    {
        id: 25,
        text: 'מה היא עיר הבירה של הודו?',
        answers: ['מומבאי', 'דרמסאלה', 'בנגלור', 'ניו דלהי'],
        correct_answer: 4
    },
    {
        id: 26,
        text: 'מה היא עיר הבירה של איטליה?',
        answers: ['מילאנו', 'מילאנו', 'ונציה', 'נאפולי'],
        correct_answer: 2
    },
    {
        id: 27,
        text: 'מה היא עיר הבירה של שוויץ?',
        answers: ['ברן', 'בריסל', 'ציריך', 'ז\'נבה'],
        correct_answer: 1
    },
    {
        id: 28,
        text: 'מה היא עיר הבירה של אלבניה?',
        answers: ['טירנה', 'שקודרה', 'דורס', 'בראט'],
        correct_answer: 1
    },
    {
        id: 29,
        text: 'באיזו מדינה נמצאת העיר \'קזבלנקה\'?',
        answers: ['איטליה', 'אלג\'יר', 'מרוקו', 'פורטוגל'],
        correct_answer: 3
    },
    {
        id: 30,
        text: 'איזו מדינה שזכתה בגביע העולם לרשונה ?',
        answers: ['ברזיל', 'איטליה', 'אורגווי', 'צרפת'],
        correct_answer: 3
    },
    {
        id: 31,
        text: 'איזו מדינה שזכתה בגביע העולם לשנת 2006',
        answers: ['אנגליה', 'ברזיל', 'גרמניה', 'איטליה'],
        correct_answer: 4
    },
    {
        id: 32,
        text: 'כמה פעמים נכנסה ישראל לגביע העולם?',
        answers: ['2', '1', '0', '7'],
        correct_answer: 2
    },
    {
        id: 33,
        text: 'איזו מדינות שזכו בגביע העולם 4 פעמים?',
        answers: ['ברזיל', 'איטליה', 'גרמניה', 'תשובה (2,3)'],
        correct_answer: 4
    },
    {
        id: 34,
        text: 'איזו מדינה שמוריכה את גביע העולם לשנת 2022',
        answers: ['יפן', 'שבידיה', 'קטר', 'נורביגיה'],
        correct_answer: 3
    },
    {
        id: 35,
        text: 'במה היא פופולרית מדינת איטליה?',
        answers: ['פיצה', 'שוארמא', 'בורגר', 'פלאפל'],
        correct_answer: 1
    },
    {
        id: 36,
        text: 'במה היא פופולרית מדינת אוקראינה?',
        answers: ['חיטה', 'שמן', 'יצור מכוניות', 'יצור משחקי ילדים'],
        correct_answer: 1
    },
    {
        id: 37,
        text: 'מהו סוג המכונית שגרמניה יצרה?',
        answers: ['הונדא', 'סקודה', 'מאזדה', 'שברולט'],
        correct_answer: 2
    },
    {
        id: 38,
        text: 'מהי עיר הבירה של קנדה?',
        answers: ['אנקרה', 'דמשק', 'מנאמה', 'אוטוואה'],
        correct_answer: 4
    },
    {
        id: 39,
        text: 'ארצות הברית הינה ה —— מבחינת מספר התושבים',
        answers: ['ראשונה', 'שנייה', 'שלישית', 'רביעית'],
        correct_answer: 3
    },
    {
        id: 40,
        text: 'החומה הגדולה של סין נבנתה בשל:',
        answers: ['יופי', 'הגנה', 'צילומים', 'בילוי זמן'],
        correct_answer: 2
    },
    {
        id: 41,
        text: 'קנדה היא המדינה ה———- מבחינת שטחה',
        answers: ['ראשונה', 'ראשונה', 'שלישית', 'רביעית'],
        correct_answer: 2
    },
    {
        id: 42,
        text: 'בונציה מסתובבים ממקום לאחר באמצעות:',
        answers: ['מכוניות', 'רכבות', 'אוטופוסים', 'סירות'],
        correct_answer: 4
    },
    {
        id: 43,
        text: 'אחד מהאתרים הפופולריים ביוון זה:',
        answers: ['שעון ביג בן', 'האוקרופוליס', 'מגדל אייפל', 'הקולוסיום'],
        correct_answer: 2
    },
    {
        id: 44,
        text: 'במה מפורסמת צרפת?',
        answers: ['מגדל פיזה', 'בורג חליפה', 'מגדל אייפל', 'מגדל שאנגחאי'],
        correct_answer: 3
    },
    {
        id: 45,
        text: 'מהו המטבע של מדינה אוסטרליה?',
        answers: ['אירו', 'אירו', 'ריאל', 'פרנק'],
        correct_answer: 2
    },
    {
        id: 46,
        text: 'מהו המטבע של מדינה  איטליה?',
        answers: ['אירו', 'דולר', 'ריאל', 'פרנק'],
        correct_answer: 1
    },
    {
        id: 47,
        text: 'מהו המטבע של מדינה ארצות הברית?',
        answers: ['אירו', 'דולר', 'ריאל', 'פרנק'],
        correct_answer: 2
    },
    {
        id: 48,
        text: 'מהו המטבע של מדינה בלגיה?',
        answers: ['אירו', 'דולר', 'ריאל', 'פרנק'],
        correct_answer: 1
    },
    {
        id: 49,
        text: 'מהו המטבע של מדינה גרמניה?',
        answers: ['אירו', 'דולר', 'ריאל', 'פרנק'],
        correct_answer: 1
    },
]

// Get question data by its id
function get_question_data(_question_id) {
    let data
    data = questions.find(question => {
        return question['id'] === _question_id
    })

    // Get questions from questions 2
    if (data === undefined) {
        data = questions2.find(question => {
            return question['id'] === _question_id
        })
    }

    return data
}
